posts/3-favorite-books.org
#+title: 3 favorite books
#+title_extra:
#+pubdate: <2025-08-07>
#+filetags: reading

A few years ago I was talking to someone on a bus, and mentioned I'd been doing
a lot of reading lately. They asked what my favorite book was, and then (when I
couldn't pick) what my top 3 were. Hilariously, I find this question impossible
to answer. I'll bitch out and pick a few subcategories for now:

3 books that affected past me in a time when I was looking for that:

- The Power of Habit, Charles Duhigg
- The Design of Everyday things, Donald Norman
- Getting Things Done, David Allen

Audio books I have relistened to many (many) times:

- Musashi, Eiji Yoshikawa
- The Age Of Madness Trilogy, Joe Abercrombie

For books in text form, I enjoy a bunch of scifi and fantasy books, and though I
have enjoyed some bunches, none feel worth listing next to the above right now.
