3-favorite-books.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>3 favorite books</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="3 favorite books">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/posts/ca_dump3/ca8e4629e309e031e8784ccfbd00a144a30e0119ce71f03bcd564aa423fc7d0b.png">
<meta property="og:url" content="https://notes.neeasade.net/3-favorite-books">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='./assets/css/colors.css?sum=cbc7f86dcba5597749ac3221baabf396'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=de2a5435182495e691565c7d598903bd'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=5a7a29b051265cf89a5173ca895cc6d0'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='./index.html'>../notes</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/3-favorite-books.org">source</a>
</div>
<h1 class=title>
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
    3 favorite books
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
</h1>
<div class="org-center">
<p>

</p>
</div>
<span class=pubinfo>
    Published 2025-08-07
</span>
<div class="posttags"> <a href='./tag-reading.html'>#reading</a> </div>
</header>
<hr>
<p>
A few years ago I was talking to someone on a bus, and mentioned I&rsquo;d been doing
a lot of reading lately. They asked what my favorite book was, and then (when I
couldn&rsquo;t pick) what my top 3 were. Hilariously, I find this question impossible
to answer. I&rsquo;ll bitch out and pick a few subcategories for now:
</p>

<p>
3 books that affected past me in a time when I was looking for that:
</p>

<ul class="org-ul">
<li>The Power of Habit, Charles Duhigg</li>
<li>The Design of Everyday things, Donald Norman</li>
<li>Getting Things Done, David Allen</li>
</ul>

<p>
Audio books I have relistened to many (many) times:
</p>

<ul class="org-ul">
<li>Musashi, Eiji Yoshikawa</li>
<li>The Age Of Madness Trilogy, Joe Abercrombie</li>
</ul>

<p>
For books in text form, I enjoy a bunch of scifi and fantasy books, and though I
have enjoyed some bunches, none feel worth listing next to the above right now.
</p>

<footer>
    <div style="float: left">
         <a href='heart.html'>newer: heart</a> 
    </div>
    <div style="text-align: right">
         <a href='cut-at-the-joints.html'>older: Cut at the joints</a> 
    </div>
</footer>
<hr>
</main>
</body>
</html>
